MikroElektronika/core_packages/PIC/XC8/def/PIC16LF18313/mcu.h
extern volatile NVMDATLbits_t NVMDATLbits __at(0x893);
// bitfield macros
#define _NVMDATL_NVMDATL_POSN                               0x0
#define _NVMDATL_NVMDATL_POSITION                           0x0
#define _NVMDATL_NVMDATL_SIZE                               0x8
#define _NVMDATL_NVMDATL_LENGTH                             0x8
#define _NVMDATL_NVMDATL_MASK                               0xFF
#define _NVMDATL_NVMDAT0_POSN                               0x0
#define _NVMDATL_NVMDAT0_POSITION                           0x0
#define _NVMDATL_NVMDAT0_SIZE                               0x1
#define _NVMDATL_NVMDAT0_LENGTH                             0x1
#define _NVMDATL_NVMDAT0_MASK                               0x1
#define _NVMDATL_NVMDAT1_POSN                               0x1
#define _NVMDATL_NVMDAT1_POSITION                           0x1
#define _NVMDATL_NVMDAT1_SIZE                               0x1
#define _NVMDATL_NVMDAT1_LENGTH                             0x1
#define _NVMDATL_NVMDAT1_MASK                               0x2
#define _NVMDATL_NVMDAT2_POSN                               0x2
#define _NVMDATL_NVMDAT2_POSITION                           0x2
#define _NVMDATL_NVMDAT2_SIZE                               0x1
#define _NVMDATL_NVMDAT2_LENGTH                             0x1
#define _NVMDATL_NVMDAT2_MASK                               0x4
#define _NVMDATL_NVMDAT3_POSN                               0x3
#define _NVMDATL_NVMDAT3_POSITION                           0x3
#define _NVMDATL_NVMDAT3_SIZE                               0x1
#define _NVMDATL_NVMDAT3_LENGTH                             0x1
#define _NVMDATL_NVMDAT3_MASK                               0x8
#define _NVMDATL_NVMDAT4_POSN                               0x4
#define _NVMDATL_NVMDAT4_POSITION                           0x4
#define _NVMDATL_NVMDAT4_SIZE                               0x1
#define _NVMDATL_NVMDAT4_LENGTH                             0x1
#define _NVMDATL_NVMDAT4_MASK                               0x10
#define _NVMDATL_NVMDAT5_POSN                               0x5
#define _NVMDATL_NVMDAT5_POSITION                           0x5
#define _NVMDATL_NVMDAT5_SIZE                               0x1
#define _NVMDATL_NVMDAT5_LENGTH                             0x1
#define _NVMDATL_NVMDAT5_MASK                               0x20
#define _NVMDATL_NVMDAT6_POSN                               0x6
#define _NVMDATL_NVMDAT6_POSITION                           0x6
#define _NVMDATL_NVMDAT6_SIZE                               0x1
#define _NVMDATL_NVMDAT6_LENGTH                             0x1
#define _NVMDATL_NVMDAT6_MASK                               0x40
#define _NVMDATL_NVMDAT7_POSN                               0x7
#define _NVMDATL_NVMDAT7_POSITION                           0x7
#define _NVMDATL_NVMDAT7_SIZE                               0x1
#define _NVMDATL_NVMDAT7_LENGTH                             0x1
#define _NVMDATL_NVMDAT7_MASK                               0x80
#define _NVMDATL_EEDAT0_POSN                                0x0
#define _NVMDATL_EEDAT0_POSITION                            0x0
#define _NVMDATL_EEDAT0_SIZE                                0x1
#define _NVMDATL_EEDAT0_LENGTH                              0x1
#define _NVMDATL_EEDAT0_MASK                                0x1
#define _NVMDATL_EEDAT1_POSN                                0x1
#define _NVMDATL_EEDAT1_POSITION                            0x1
#define _NVMDATL_EEDAT1_SIZE                                0x1
#define _NVMDATL_EEDAT1_LENGTH                              0x1
#define _NVMDATL_EEDAT1_MASK                                0x2
#define _NVMDATL_EEDAT2_POSN                                0x2
#define _NVMDATL_EEDAT2_POSITION                            0x2
#define _NVMDATL_EEDAT2_SIZE                                0x1
#define _NVMDATL_EEDAT2_LENGTH                              0x1
#define _NVMDATL_EEDAT2_MASK                                0x4
#define _NVMDATL_EEDAT3_POSN                                0x3
#define _NVMDATL_EEDAT3_POSITION                            0x3
#define _NVMDATL_EEDAT3_SIZE                                0x1
#define _NVMDATL_EEDAT3_LENGTH                              0x1
#define _NVMDATL_EEDAT3_MASK                                0x8
#define _NVMDATL_EEDAT4_POSN                                0x4
#define _NVMDATL_EEDAT4_POSITION                            0x4
#define _NVMDATL_EEDAT4_SIZE                                0x1
#define _NVMDATL_EEDAT4_LENGTH                              0x1
#define _NVMDATL_EEDAT4_MASK                                0x10
#define _NVMDATL_EEDAT5_POSN                                0x5
#define _NVMDATL_EEDAT5_POSITION                            0x5
#define _NVMDATL_EEDAT5_SIZE                                0x1
#define _NVMDATL_EEDAT5_LENGTH                              0x1
#define _NVMDATL_EEDAT5_MASK                                0x20
#define _NVMDATL_EEDAT6_POSN                                0x6
#define _NVMDATL_EEDAT6_POSITION                            0x6
#define _NVMDATL_EEDAT6_SIZE                                0x1
#define _NVMDATL_EEDAT6_LENGTH                              0x1
#define _NVMDATL_EEDAT6_MASK                                0x40
#define _NVMDATL_EEDAT7_POSN                                0x7
#define _NVMDATL_EEDAT7_POSITION                            0x7
#define _NVMDATL_EEDAT7_SIZE                                0x1
#define _NVMDATL_EEDAT7_LENGTH                              0x1
#define _NVMDATL_EEDAT7_MASK                                0x80
#define _NVMDATL_EEDATL_POSN                                0x0
#define _NVMDATL_EEDATL_POSITION                            0x0
#define _NVMDATL_EEDATL_SIZE                                0x8
#define _NVMDATL_EEDATL_LENGTH                              0x8
#define _NVMDATL_EEDATL_MASK                                0xFF
#define _NVMDATL_PMDATL_POSN                                0x0
#define _NVMDATL_PMDATL_POSITION                            0x0
#define _NVMDATL_PMDATL_SIZE                                0x8
#define _NVMDATL_PMDATL_LENGTH                              0x8
#define _NVMDATL_PMDATL_MASK                                0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned NVMDATL                :8;
    };
    struct {
        unsigned NVMDAT0                :1;
        unsigned NVMDAT1                :1;
        unsigned NVMDAT2                :1;
        unsigned NVMDAT3                :1;
        unsigned NVMDAT4                :1;
        unsigned NVMDAT5                :1;
        unsigned NVMDAT6                :1;
        unsigned NVMDAT7                :1;
    };
    struct {
        unsigned EEDAT0                 :1;
        unsigned EEDAT1                 :1;
        unsigned EEDAT2                 :1;
        unsigned EEDAT3                 :1;
        unsigned EEDAT4                 :1;
        unsigned EEDAT5                 :1;
        unsigned EEDAT6                 :1;
        unsigned EEDAT7                 :1;
    };
    struct {
        unsigned EEDATL                 :8;
    };
    struct {
        unsigned PMDATL                 :8;
    };
} EEDATLbits_t;
extern volatile EEDATLbits_t EEDATLbits __at(0x893);
// bitfield macros
#define _EEDATL_NVMDATL_POSN                                0x0
#define _EEDATL_NVMDATL_POSITION                            0x0
#define _EEDATL_NVMDATL_SIZE                                0x8
#define _EEDATL_NVMDATL_LENGTH                              0x8
#define _EEDATL_NVMDATL_MASK                                0xFF
#define _EEDATL_NVMDAT0_POSN                                0x0
#define _EEDATL_NVMDAT0_POSITION                            0x0
#define _EEDATL_NVMDAT0_SIZE                                0x1
#define _EEDATL_NVMDAT0_LENGTH                              0x1
#define _EEDATL_NVMDAT0_MASK                                0x1
#define _EEDATL_NVMDAT1_POSN                                0x1
#define _EEDATL_NVMDAT1_POSITION                            0x1
#define _EEDATL_NVMDAT1_SIZE                                0x1
#define _EEDATL_NVMDAT1_LENGTH                              0x1
#define _EEDATL_NVMDAT1_MASK                                0x2
#define _EEDATL_NVMDAT2_POSN                                0x2
#define _EEDATL_NVMDAT2_POSITION                            0x2
#define _EEDATL_NVMDAT2_SIZE                                0x1
#define _EEDATL_NVMDAT2_LENGTH                              0x1
#define _EEDATL_NVMDAT2_MASK                                0x4
#define _EEDATL_NVMDAT3_POSN                                0x3
#define _EEDATL_NVMDAT3_POSITION                            0x3
#define _EEDATL_NVMDAT3_SIZE                                0x1
#define _EEDATL_NVMDAT3_LENGTH                              0x1
#define _EEDATL_NVMDAT3_MASK                                0x8
#define _EEDATL_NVMDAT4_POSN                                0x4
#define _EEDATL_NVMDAT4_POSITION                            0x4
#define _EEDATL_NVMDAT4_SIZE                                0x1
#define _EEDATL_NVMDAT4_LENGTH                              0x1
#define _EEDATL_NVMDAT4_MASK                                0x10
#define _EEDATL_NVMDAT5_POSN                                0x5
#define _EEDATL_NVMDAT5_POSITION                            0x5
#define _EEDATL_NVMDAT5_SIZE                                0x1
#define _EEDATL_NVMDAT5_LENGTH                              0x1
#define _EEDATL_NVMDAT5_MASK                                0x20
#define _EEDATL_NVMDAT6_POSN                                0x6
#define _EEDATL_NVMDAT6_POSITION                            0x6
#define _EEDATL_NVMDAT6_SIZE                                0x1
#define _EEDATL_NVMDAT6_LENGTH                              0x1
#define _EEDATL_NVMDAT6_MASK                                0x40
#define _EEDATL_NVMDAT7_POSN                                0x7
#define _EEDATL_NVMDAT7_POSITION                            0x7
#define _EEDATL_NVMDAT7_SIZE                                0x1
#define _EEDATL_NVMDAT7_LENGTH                              0x1
#define _EEDATL_NVMDAT7_MASK                                0x80
#define _EEDATL_EEDAT0_POSN                                 0x0
#define _EEDATL_EEDAT0_POSITION                             0x0
#define _EEDATL_EEDAT0_SIZE                                 0x1
#define _EEDATL_EEDAT0_LENGTH                               0x1
#define _EEDATL_EEDAT0_MASK                                 0x1
#define _EEDATL_EEDAT1_POSN                                 0x1
#define _EEDATL_EEDAT1_POSITION                             0x1
#define _EEDATL_EEDAT1_SIZE                                 0x1
#define _EEDATL_EEDAT1_LENGTH                               0x1
#define _EEDATL_EEDAT1_MASK                                 0x2
#define _EEDATL_EEDAT2_POSN                                 0x2
#define _EEDATL_EEDAT2_POSITION                             0x2
#define _EEDATL_EEDAT2_SIZE                                 0x1
#define _EEDATL_EEDAT2_LENGTH                               0x1
#define _EEDATL_EEDAT2_MASK                                 0x4
#define _EEDATL_EEDAT3_POSN                                 0x3
#define _EEDATL_EEDAT3_POSITION                             0x3
#define _EEDATL_EEDAT3_SIZE                                 0x1
#define _EEDATL_EEDAT3_LENGTH                               0x1
#define _EEDATL_EEDAT3_MASK                                 0x8
#define _EEDATL_EEDAT4_POSN                                 0x4
#define _EEDATL_EEDAT4_POSITION                             0x4
#define _EEDATL_EEDAT4_SIZE                                 0x1
#define _EEDATL_EEDAT4_LENGTH                               0x1
#define _EEDATL_EEDAT4_MASK                                 0x10
#define _EEDATL_EEDAT5_POSN                                 0x5
#define _EEDATL_EEDAT5_POSITION                             0x5
#define _EEDATL_EEDAT5_SIZE                                 0x1
#define _EEDATL_EEDAT5_LENGTH                               0x1
#define _EEDATL_EEDAT5_MASK                                 0x20
#define _EEDATL_EEDAT6_POSN                                 0x6
#define _EEDATL_EEDAT6_POSITION                             0x6
#define _EEDATL_EEDAT6_SIZE                                 0x1
#define _EEDATL_EEDAT6_LENGTH                               0x1
#define _EEDATL_EEDAT6_MASK                                 0x40
#define _EEDATL_EEDAT7_POSN                                 0x7
#define _EEDATL_EEDAT7_POSITION                             0x7
#define _EEDATL_EEDAT7_SIZE                                 0x1
#define _EEDATL_EEDAT7_LENGTH                               0x1
#define _EEDATL_EEDAT7_MASK                                 0x80
#define _EEDATL_EEDATL_POSN                                 0x0
#define _EEDATL_EEDATL_POSITION                             0x0
#define _EEDATL_EEDATL_SIZE                                 0x8
#define _EEDATL_EEDATL_LENGTH                               0x8
#define _EEDATL_EEDATL_MASK                                 0xFF
#define _EEDATL_PMDATL_POSN                                 0x0
#define _EEDATL_PMDATL_POSITION                             0x0
#define _EEDATL_PMDATL_SIZE                                 0x8
#define _EEDATL_PMDATL_LENGTH                               0x8
#define _EEDATL_PMDATL_MASK                                 0xFF
typedef union {
    struct {
        unsigned NVMDATL                :8;
    };
    struct {
        unsigned NVMDAT0                :1;
        unsigned NVMDAT1                :1;
        unsigned NVMDAT2                :1;
        unsigned NVMDAT3                :1;
        unsigned NVMDAT4                :1;
        unsigned NVMDAT5                :1;
        unsigned NVMDAT6                :1;
        unsigned NVMDAT7                :1;
    };
    struct {
        unsigned EEDAT0                 :1;
        unsigned EEDAT1                 :1;
        unsigned EEDAT2                 :1;
        unsigned EEDAT3                 :1;
        unsigned EEDAT4                 :1;
        unsigned EEDAT5                 :1;
        unsigned EEDAT6                 :1;
        unsigned EEDAT7                 :1;
    };
    struct {
        unsigned EEDATL                 :8;
    };
    struct {
        unsigned PMDATL                 :8;
    };
} PMDATLbits_t;
extern volatile PMDATLbits_t PMDATLbits __at(0x893);
// bitfield macros
#define _PMDATL_NVMDATL_POSN                                0x0
#define _PMDATL_NVMDATL_POSITION                            0x0
#define _PMDATL_NVMDATL_SIZE                                0x8
#define _PMDATL_NVMDATL_LENGTH                              0x8
#define _PMDATL_NVMDATL_MASK                                0xFF
#define _PMDATL_NVMDAT0_POSN                                0x0
#define _PMDATL_NVMDAT0_POSITION                            0x0
#define _PMDATL_NVMDAT0_SIZE                                0x1
#define _PMDATL_NVMDAT0_LENGTH                              0x1
#define _PMDATL_NVMDAT0_MASK                                0x1
#define _PMDATL_NVMDAT1_POSN                                0x1
#define _PMDATL_NVMDAT1_POSITION                            0x1
#define _PMDATL_NVMDAT1_SIZE                                0x1
#define _PMDATL_NVMDAT1_LENGTH                              0x1
#define _PMDATL_NVMDAT1_MASK                                0x2
#define _PMDATL_NVMDAT2_POSN                                0x2
#define _PMDATL_NVMDAT2_POSITION                            0x2
#define _PMDATL_NVMDAT2_SIZE                                0x1
#define _PMDATL_NVMDAT2_LENGTH                              0x1
#define _PMDATL_NVMDAT2_MASK                                0x4
#define _PMDATL_NVMDAT3_POSN                                0x3
#define _PMDATL_NVMDAT3_POSITION                            0x3
#define _PMDATL_NVMDAT3_SIZE                                0x1
#define _PMDATL_NVMDAT3_LENGTH                              0x1
#define _PMDATL_NVMDAT3_MASK                                0x8
#define _PMDATL_NVMDAT4_POSN                                0x4
#define _PMDATL_NVMDAT4_POSITION                            0x4
#define _PMDATL_NVMDAT4_SIZE                                0x1
#define _PMDATL_NVMDAT4_LENGTH                              0x1
#define _PMDATL_NVMDAT4_MASK                                0x10
#define _PMDATL_NVMDAT5_POSN                                0x5
#define _PMDATL_NVMDAT5_POSITION                            0x5
#define _PMDATL_NVMDAT5_SIZE                                0x1
#define _PMDATL_NVMDAT5_LENGTH                              0x1
#define _PMDATL_NVMDAT5_MASK                                0x20
#define _PMDATL_NVMDAT6_POSN                                0x6
#define _PMDATL_NVMDAT6_POSITION                            0x6
#define _PMDATL_NVMDAT6_SIZE                                0x1
#define _PMDATL_NVMDAT6_LENGTH                              0x1
#define _PMDATL_NVMDAT6_MASK                                0x40
#define _PMDATL_NVMDAT7_POSN                                0x7
#define _PMDATL_NVMDAT7_POSITION                            0x7
#define _PMDATL_NVMDAT7_SIZE                                0x1
#define _PMDATL_NVMDAT7_LENGTH                              0x1
#define _PMDATL_NVMDAT7_MASK                                0x80
#define _PMDATL_EEDAT0_POSN                                 0x0
#define _PMDATL_EEDAT0_POSITION                             0x0
#define _PMDATL_EEDAT0_SIZE                                 0x1
#define _PMDATL_EEDAT0_LENGTH                               0x1
#define _PMDATL_EEDAT0_MASK                                 0x1
#define _PMDATL_EEDAT1_POSN                                 0x1
#define _PMDATL_EEDAT1_POSITION                             0x1
#define _PMDATL_EEDAT1_SIZE                                 0x1
#define _PMDATL_EEDAT1_LENGTH                               0x1
#define _PMDATL_EEDAT1_MASK                                 0x2
#define _PMDATL_EEDAT2_POSN                                 0x2
#define _PMDATL_EEDAT2_POSITION                             0x2
#define _PMDATL_EEDAT2_SIZE                                 0x1
#define _PMDATL_EEDAT2_LENGTH                               0x1
#define _PMDATL_EEDAT2_MASK                                 0x4
#define _PMDATL_EEDAT3_POSN                                 0x3
#define _PMDATL_EEDAT3_POSITION                             0x3
#define _PMDATL_EEDAT3_SIZE                                 0x1
#define _PMDATL_EEDAT3_LENGTH                               0x1
#define _PMDATL_EEDAT3_MASK                                 0x8
#define _PMDATL_EEDAT4_POSN                                 0x4
#define _PMDATL_EEDAT4_POSITION                             0x4
#define _PMDATL_EEDAT4_SIZE                                 0x1
#define _PMDATL_EEDAT4_LENGTH                               0x1
#define _PMDATL_EEDAT4_MASK                                 0x10
#define _PMDATL_EEDAT5_POSN                                 0x5
#define _PMDATL_EEDAT5_POSITION                             0x5
#define _PMDATL_EEDAT5_SIZE                                 0x1
#define _PMDATL_EEDAT5_LENGTH                               0x1
#define _PMDATL_EEDAT5_MASK                                 0x20
#define _PMDATL_EEDAT6_POSN                                 0x6
#define _PMDATL_EEDAT6_POSITION                             0x6
#define _PMDATL_EEDAT6_SIZE                                 0x1
#define _PMDATL_EEDAT6_LENGTH                               0x1
#define _PMDATL_EEDAT6_MASK                                 0x40
#define _PMDATL_EEDAT7_POSN                                 0x7
#define _PMDATL_EEDAT7_POSITION                             0x7
#define _PMDATL_EEDAT7_SIZE                                 0x1
#define _PMDATL_EEDAT7_LENGTH                               0x1
#define _PMDATL_EEDAT7_MASK                                 0x80
#define _PMDATL_EEDATL_POSN                                 0x0
#define _PMDATL_EEDATL_POSITION                             0x0
#define _PMDATL_EEDATL_SIZE                                 0x8
#define _PMDATL_EEDATL_LENGTH                               0x8
#define _PMDATL_EEDATL_MASK                                 0xFF
#define _PMDATL_PMDATL_POSN                                 0x0
#define _PMDATL_PMDATL_POSITION                             0x0
#define _PMDATL_PMDATL_SIZE                                 0x8
#define _PMDATL_PMDATL_LENGTH                               0x8
#define _PMDATL_PMDATL_MASK                                 0xFF

// Register: NVMDATH
#define NVMDATH NVMDATH
extern volatile unsigned char           NVMDATH             __at(0x894);
#ifndef _LIB_BUILD
asm("NVMDATH equ 0894h");
#endif
// aliases
extern volatile unsigned char           EEDATH              __at(0x894);
#ifndef _LIB_BUILD
asm("EEDATH equ 0894h");
#endif
extern volatile unsigned char           PMDATH              __at(0x894);
#ifndef _LIB_BUILD
asm("PMDATH equ 0894h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMDATH                :6;
    };
    struct {
        unsigned NVMDAT8                :1;
        unsigned NVMDAT9                :1;
        unsigned NVMDAT10               :1;
        unsigned NVMDAT11               :1;
        unsigned NVMDAT12               :1;
        unsigned NVMDAT13               :1;
    };
    struct {
        unsigned EEDAT8                 :1;
        unsigned EEDAT9                 :1;
        unsigned EEDAT10                :1;
        unsigned EEDAT11                :1;
        unsigned EEDAT12                :1;
        unsigned EEDAT13                :1;
    };
    struct {
        unsigned EEDATH                 :6;
    };
    struct {
        unsigned PMDATH                 :6;
    };
} NVMDATHbits_t;
