MikroElektronika/core_packages/PIC/XC8/def/PIC16LF18313/mcu.h
extern volatile NVMDATHbits_t NVMDATHbits __at(0x894);
// bitfield macros
#define _NVMDATH_NVMDATH_POSN                               0x0
#define _NVMDATH_NVMDATH_POSITION                           0x0
#define _NVMDATH_NVMDATH_SIZE                               0x6
#define _NVMDATH_NVMDATH_LENGTH                             0x6
#define _NVMDATH_NVMDATH_MASK                               0x3F
#define _NVMDATH_NVMDAT8_POSN                               0x0
#define _NVMDATH_NVMDAT8_POSITION                           0x0
#define _NVMDATH_NVMDAT8_SIZE                               0x1
#define _NVMDATH_NVMDAT8_LENGTH                             0x1
#define _NVMDATH_NVMDAT8_MASK                               0x1
#define _NVMDATH_NVMDAT9_POSN                               0x1
#define _NVMDATH_NVMDAT9_POSITION                           0x1
#define _NVMDATH_NVMDAT9_SIZE                               0x1
#define _NVMDATH_NVMDAT9_LENGTH                             0x1
#define _NVMDATH_NVMDAT9_MASK                               0x2
#define _NVMDATH_NVMDAT10_POSN                              0x2
#define _NVMDATH_NVMDAT10_POSITION                          0x2
#define _NVMDATH_NVMDAT10_SIZE                              0x1
#define _NVMDATH_NVMDAT10_LENGTH                            0x1
#define _NVMDATH_NVMDAT10_MASK                              0x4
#define _NVMDATH_NVMDAT11_POSN                              0x3
#define _NVMDATH_NVMDAT11_POSITION                          0x3
#define _NVMDATH_NVMDAT11_SIZE                              0x1
#define _NVMDATH_NVMDAT11_LENGTH                            0x1
#define _NVMDATH_NVMDAT11_MASK                              0x8
#define _NVMDATH_NVMDAT12_POSN                              0x4
#define _NVMDATH_NVMDAT12_POSITION                          0x4
#define _NVMDATH_NVMDAT12_SIZE                              0x1
#define _NVMDATH_NVMDAT12_LENGTH                            0x1
#define _NVMDATH_NVMDAT12_MASK                              0x10
#define _NVMDATH_NVMDAT13_POSN                              0x5
#define _NVMDATH_NVMDAT13_POSITION                          0x5
#define _NVMDATH_NVMDAT13_SIZE                              0x1
#define _NVMDATH_NVMDAT13_LENGTH                            0x1
#define _NVMDATH_NVMDAT13_MASK                              0x20
#define _NVMDATH_EEDAT8_POSN                                0x0
#define _NVMDATH_EEDAT8_POSITION                            0x0
#define _NVMDATH_EEDAT8_SIZE                                0x1
#define _NVMDATH_EEDAT8_LENGTH                              0x1
#define _NVMDATH_EEDAT8_MASK                                0x1
#define _NVMDATH_EEDAT9_POSN                                0x1
#define _NVMDATH_EEDAT9_POSITION                            0x1
#define _NVMDATH_EEDAT9_SIZE                                0x1
#define _NVMDATH_EEDAT9_LENGTH                              0x1
#define _NVMDATH_EEDAT9_MASK                                0x2
#define _NVMDATH_EEDAT10_POSN                               0x2
#define _NVMDATH_EEDAT10_POSITION                           0x2
#define _NVMDATH_EEDAT10_SIZE                               0x1
#define _NVMDATH_EEDAT10_LENGTH                             0x1
#define _NVMDATH_EEDAT10_MASK                               0x4
#define _NVMDATH_EEDAT11_POSN                               0x3
#define _NVMDATH_EEDAT11_POSITION                           0x3
#define _NVMDATH_EEDAT11_SIZE                               0x1
#define _NVMDATH_EEDAT11_LENGTH                             0x1
#define _NVMDATH_EEDAT11_MASK                               0x8
#define _NVMDATH_EEDAT12_POSN                               0x4
#define _NVMDATH_EEDAT12_POSITION                           0x4
#define _NVMDATH_EEDAT12_SIZE                               0x1
#define _NVMDATH_EEDAT12_LENGTH                             0x1
#define _NVMDATH_EEDAT12_MASK                               0x10
#define _NVMDATH_EEDAT13_POSN                               0x5
#define _NVMDATH_EEDAT13_POSITION                           0x5
#define _NVMDATH_EEDAT13_SIZE                               0x1
#define _NVMDATH_EEDAT13_LENGTH                             0x1
#define _NVMDATH_EEDAT13_MASK                               0x20
#define _NVMDATH_EEDATH_POSN                                0x0
#define _NVMDATH_EEDATH_POSITION                            0x0
#define _NVMDATH_EEDATH_SIZE                                0x6
#define _NVMDATH_EEDATH_LENGTH                              0x6
#define _NVMDATH_EEDATH_MASK                                0x3F
#define _NVMDATH_PMDATH_POSN                                0x0
#define _NVMDATH_PMDATH_POSITION                            0x0
#define _NVMDATH_PMDATH_SIZE                                0x6
#define _NVMDATH_PMDATH_LENGTH                              0x6
#define _NVMDATH_PMDATH_MASK                                0x3F
// alias bitfield definitions
typedef union {
    struct {
        unsigned NVMDATH                :6;
    };
    struct {
        unsigned NVMDAT8                :1;
        unsigned NVMDAT9                :1;
        unsigned NVMDAT10               :1;
        unsigned NVMDAT11               :1;
        unsigned NVMDAT12               :1;
        unsigned NVMDAT13               :1;
    };
    struct {
        unsigned EEDAT8                 :1;
        unsigned EEDAT9                 :1;
        unsigned EEDAT10                :1;
        unsigned EEDAT11                :1;
        unsigned EEDAT12                :1;
        unsigned EEDAT13                :1;
    };
    struct {
        unsigned EEDATH                 :6;
    };
    struct {
        unsigned PMDATH                 :6;
    };
} EEDATHbits_t;
extern volatile EEDATHbits_t EEDATHbits __at(0x894);
// bitfield macros
#define _EEDATH_NVMDATH_POSN                                0x0
#define _EEDATH_NVMDATH_POSITION                            0x0
#define _EEDATH_NVMDATH_SIZE                                0x6
#define _EEDATH_NVMDATH_LENGTH                              0x6
#define _EEDATH_NVMDATH_MASK                                0x3F
#define _EEDATH_NVMDAT8_POSN                                0x0
#define _EEDATH_NVMDAT8_POSITION                            0x0
#define _EEDATH_NVMDAT8_SIZE                                0x1
#define _EEDATH_NVMDAT8_LENGTH                              0x1
#define _EEDATH_NVMDAT8_MASK                                0x1
#define _EEDATH_NVMDAT9_POSN                                0x1
#define _EEDATH_NVMDAT9_POSITION                            0x1
#define _EEDATH_NVMDAT9_SIZE                                0x1
#define _EEDATH_NVMDAT9_LENGTH                              0x1
#define _EEDATH_NVMDAT9_MASK                                0x2
#define _EEDATH_NVMDAT10_POSN                               0x2
#define _EEDATH_NVMDAT10_POSITION                           0x2
#define _EEDATH_NVMDAT10_SIZE                               0x1
#define _EEDATH_NVMDAT10_LENGTH                             0x1
#define _EEDATH_NVMDAT10_MASK                               0x4
#define _EEDATH_NVMDAT11_POSN                               0x3
#define _EEDATH_NVMDAT11_POSITION                           0x3
#define _EEDATH_NVMDAT11_SIZE                               0x1
#define _EEDATH_NVMDAT11_LENGTH                             0x1
#define _EEDATH_NVMDAT11_MASK                               0x8
#define _EEDATH_NVMDAT12_POSN                               0x4
#define _EEDATH_NVMDAT12_POSITION                           0x4
#define _EEDATH_NVMDAT12_SIZE                               0x1
#define _EEDATH_NVMDAT12_LENGTH                             0x1
#define _EEDATH_NVMDAT12_MASK                               0x10
#define _EEDATH_NVMDAT13_POSN                               0x5
#define _EEDATH_NVMDAT13_POSITION                           0x5
#define _EEDATH_NVMDAT13_SIZE                               0x1
#define _EEDATH_NVMDAT13_LENGTH                             0x1
#define _EEDATH_NVMDAT13_MASK                               0x20
#define _EEDATH_EEDAT8_POSN                                 0x0
#define _EEDATH_EEDAT8_POSITION                             0x0
#define _EEDATH_EEDAT8_SIZE                                 0x1
#define _EEDATH_EEDAT8_LENGTH                               0x1
#define _EEDATH_EEDAT8_MASK                                 0x1
#define _EEDATH_EEDAT9_POSN                                 0x1
#define _EEDATH_EEDAT9_POSITION                             0x1
#define _EEDATH_EEDAT9_SIZE                                 0x1
#define _EEDATH_EEDAT9_LENGTH                               0x1
#define _EEDATH_EEDAT9_MASK                                 0x2
#define _EEDATH_EEDAT10_POSN                                0x2
#define _EEDATH_EEDAT10_POSITION                            0x2
#define _EEDATH_EEDAT10_SIZE                                0x1
#define _EEDATH_EEDAT10_LENGTH                              0x1
#define _EEDATH_EEDAT10_MASK                                0x4
#define _EEDATH_EEDAT11_POSN                                0x3
#define _EEDATH_EEDAT11_POSITION                            0x3
#define _EEDATH_EEDAT11_SIZE                                0x1
#define _EEDATH_EEDAT11_LENGTH                              0x1
#define _EEDATH_EEDAT11_MASK                                0x8
#define _EEDATH_EEDAT12_POSN                                0x4
#define _EEDATH_EEDAT12_POSITION                            0x4
#define _EEDATH_EEDAT12_SIZE                                0x1
#define _EEDATH_EEDAT12_LENGTH                              0x1
#define _EEDATH_EEDAT12_MASK                                0x10
#define _EEDATH_EEDAT13_POSN                                0x5
#define _EEDATH_EEDAT13_POSITION                            0x5
#define _EEDATH_EEDAT13_SIZE                                0x1
#define _EEDATH_EEDAT13_LENGTH                              0x1
#define _EEDATH_EEDAT13_MASK                                0x20
#define _EEDATH_EEDATH_POSN                                 0x0
#define _EEDATH_EEDATH_POSITION                             0x0
#define _EEDATH_EEDATH_SIZE                                 0x6
#define _EEDATH_EEDATH_LENGTH                               0x6
#define _EEDATH_EEDATH_MASK                                 0x3F
#define _EEDATH_PMDATH_POSN                                 0x0
#define _EEDATH_PMDATH_POSITION                             0x0
#define _EEDATH_PMDATH_SIZE                                 0x6
#define _EEDATH_PMDATH_LENGTH                               0x6
#define _EEDATH_PMDATH_MASK                                 0x3F
typedef union {
    struct {
        unsigned NVMDATH                :6;
    };
    struct {
        unsigned NVMDAT8                :1;
        unsigned NVMDAT9                :1;
        unsigned NVMDAT10               :1;
        unsigned NVMDAT11               :1;
        unsigned NVMDAT12               :1;
        unsigned NVMDAT13               :1;
    };
    struct {
        unsigned EEDAT8                 :1;
        unsigned EEDAT9                 :1;
        unsigned EEDAT10                :1;
        unsigned EEDAT11                :1;
        unsigned EEDAT12                :1;
        unsigned EEDAT13                :1;
    };
    struct {
        unsigned EEDATH                 :6;
    };
    struct {
        unsigned PMDATH                 :6;
    };
} PMDATHbits_t;
